README.tex
% Created 2018-12-25 Tue 19:26
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{natbib}
\usepackage[version=3]{mhchem}
\usepackage{makeidx}
\author{Jonathan}
\date{\today}
\title{Developping distributed systems with the actor model}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.3.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents


\section{Introduction}
\label{sec-1}

Developping distributed systems is not a distributed.simple task as it involves
dealing with problems such as concurrency, fault tolerance, and
scaling. Over the last decades, several models has been proposed to
organize computing resources working in an distributed systems. One of
them is the actor model proposed by Carl Hewitt in 1973
\cite{hewitt1973session}, which has inspired a language such as Erlang,
or frameworks for distributed systems such as Akka.

Roughly, the actor models proposes to organise distributed systems
according to the following principles:

\begin{enumerate}
\item Everything in the system is an actor
\item An actor can receive and send messages to other actor (including itself)
\item An actor can process one message at a time
\item at the end of 3., an actor can send one or several messages to one or several actors
\item at the end of 3., an actor can changes its behaviour for the next message
\item at the end of 3., an actor can create new actors
\end{enumerate}

Actors have private states that are not directly shared with other
actors. Instead, they collaborate via exchanges of messages. The lack
of shared states prevent the need for synchronization systems such as
lock or mutex. Thus, the actor model is a good fit for building
distributed systems or highly concurrent applications.

\section{Objective of the session}
\label{sec-2}

The objective of this session is double : first we will develop a
distributed.simple client/server application using Akka. Second, we will reuse the
code developed for the first step and implement the Chord algorithm
\cite{stoica2003chord}, a well know fully decentralized algorithm.

\section{Using Akka to develop distributed software}
\label{sec-3}
\section{Implementing Chord}
\label{sec-4}


\bibliographystyle{unsrt}
\bibliography{references}
% Emacs 25.3.1 (Org mode 8.2.10)
\end{document}
